# -*- coding: utf-8 -*-
"""
Created on Sun Jul 19 20:52:00 2020

@author: yscho


"""

def RootCauses_200830():
    ################################################################################ 
    yymmdd = '200830' 
    ################################################################################ 
    
    #################### [1000, 30, 100] scenario 1,2,3
    # n_observations = 1000
    # n_process = 30
    # n_time = 100
    
    dataset_shape_1 = (1000, 30, 100)
    
    root_causes_1_1 = [[13, 40, 70],[14, 40, 70],[15, 40, 70]] 
    root_causes_1_2 = [[14, 10, 30],[15, 10, 30],[14, 70, 90],[15, 70, 90]] 
    root_causes_1_3 = [[3, 10, 40],[4, 10, 40],[27, 60, 90],[28, 60, 90]] 
    
    #################### [1000, 100, 500] scenario 1,2,3
    # n_observations = 1000
    # n_process = 100
    # n_time = 500
    
    dataset_shape_2 = (1000, 100, 500)
    
    root_causes_2_1 = [[50, 100, 200],[51, 100, 200],[52, 100, 200],[53, 100, 200],[54, 100, 200],[55, 100, 200]] 
    root_causes_2_2 = [[20, 50, 150],[21, 50, 150],[22, 50, 150],[20, 350, 450],[21, 350, 450],[22, 350, 450]]
    root_causes_2_3 = [[20, 50, 150],[21, 50, 150],[22, 50, 150],[80, 350, 450],[81, 350, 450],[82, 350, 450]]
    
    #################### [1000, 300, 1000] scenario 1,2,3
    # n_observations = 1000
    # n_process = 50
    # n_time = 250
    
    dataset_shape_3 = (1000, 50, 250)
    
    root_causes_3_1 = [[10, 100, 200],[11, 100, 200],[12, 100, 200],[13, 100, 200],[14, 100, 200],[15, 100, 200]] 
    root_causes_3_2 = [[31, 100, 200],[32, 100, 200],[33, 100, 200],[34, 100, 200],[35, 100, 200],
                       [36, 100, 200],[37, 100, 200],[38, 100, 200],[39, 100, 200],[40, 100, 200]]
    root_causes_3_3 = [[5, 0, 50],[6, 0, 50],[7, 0, 50],[8, 200, 250],[9, 200, 250],[10, 200, 250],
                       [40, 0, 50],[41, 0, 50],[42, 0, 50],[43, 200, 250],[44, 200, 250],[45, 200, 250]]
    
    root_cause_list = [root_causes_1_1, root_causes_1_2, root_causes_1_3,
                       root_causes_2_1, root_causes_2_2, root_causes_2_3,
                       root_causes_3_1, root_causes_3_2, root_causes_3_3]
    
    dataset_shape_list = [dataset_shape_1, dataset_shape_1, dataset_shape_1,
                          dataset_shape_2, dataset_shape_2, dataset_shape_2, 
                          dataset_shape_3, dataset_shape_3, dataset_shape_3]
    return dataset_shape_list, root_cause_list

def RootCauses_200831():
    
    ################################################################################ 
    yymmdd = '200831' 
    ################################################################################ 
    
    #################### [1000, 30, 100] scenario 1,2,3
    # n_observations = 1000
    # n_process = 30
    # n_time = 100
    
    dataset_shape_1 = (1000, 30, 100)
    
    root_causes_1_1 = [[13, 40, 70],[14, 40, 70],[15, 40, 70]] 
    root_causes_1_2 = [[14, 10, 30],[15, 10, 30],[14, 70, 90],[15, 70, 90]] 
    root_causes_1_3 = [[3, 10, 40],[4, 10, 40],[27, 60, 90],[28, 60, 90]] 
    
    #################### [1000, 100, 500] scenario 1,2,3
    # n_observations = 1000
    # n_process = 100
    # n_time = 500
    
    dataset_shape_2 = (1000, 100, 500)
    
    root_causes_2_1 = [[50, 100, 200],[51, 100, 200],[52, 100, 200],[53, 100, 200],[54, 100, 200],[55, 100, 200]] 
    root_causes_2_2 = [[20, 50, 150],[21, 50, 150],[22, 50, 150],[20, 350, 450],[21, 350, 450],[22, 350, 450]]
    root_causes_2_3 = [[20, 50, 150],[21, 50, 150],[22, 50, 150],[80, 350, 450],[81, 350, 450],[82, 350, 450]]
    
    #################### [1000, 300, 1000] scenario 1,2,3
    # n_observations = 1000
    # n_process = 50
    # n_time = 250
    
    dataset_shape_3 = (1000, 50, 250)
    
    root_causes_3_1 = [[10, 100, 200],[11, 100, 200],[12, 100, 200],[13, 100, 200],[14, 100, 200],[15, 100, 200]] 
    root_causes_3_2 = [[31, 100, 200],[32, 100, 200],[33, 100, 200],[34, 100, 200],[35, 100, 200],
                       [36, 100, 200],[37, 100, 200],[38, 100, 200],[39, 100, 200],[40, 100, 200]]
    root_causes_3_3 = [[5, 0, 50],[6, 0, 50],[7, 0, 50],[8, 200, 250],[9, 200, 250],[10, 200, 250],
                       [40, 0, 50],[41, 0, 50],[42, 0, 50],[43, 200, 250],[44, 200, 250],[45, 200, 250]]
    
    root_cause_list = [root_causes_1_1, root_causes_1_2, root_causes_1_3,
                       root_causes_2_1, root_causes_2_2, root_causes_2_3,
                       root_causes_3_1, root_causes_3_2, root_causes_3_3]
    
    dataset_shape_list = [dataset_shape_1, dataset_shape_1, dataset_shape_1,
                          dataset_shape_2, dataset_shape_2, dataset_shape_2, 
                          dataset_shape_3, dataset_shape_3, dataset_shape_3]
    return dataset_shape_list, root_cause_list

def RootCauses_200906():
    yymmdd = '200906' # yymmdd = '200831', # yymmdd = '200830'
    #################### [1000, 30, 100] scenario 1,2,3
    # n_observations = 1000
    # n_process = 50
    # n_time = 100
    root_causes_list_1_config = (1000, 50, 100)
    root_causes_1_1 = [[6, 40, 70],[7, 40, 70],[8, 40, 70]] 
    root_causes_1_2 = [[24, 10, 30],[25, 10, 30],[26, 10, 30],
                       [24, 70, 90],[25, 70, 90],[26, 70, 90]]
    root_causes_1_3 = [[1, 0, 50],[2, 0, 50],[3, 0, 50],[4, 0, 50],[5, 0, 50],
                       [45, 50, 100],[46, 50, 100],[47, 50, 100],[48, 50, 100],[49, 50, 100]] 
    root_causes_list_1 = [root_causes_1_1, root_causes_1_2, root_causes_1_3]
    
    #################### [1000, 100, 500] scenario 1,2,3
    # n_observations = 1000
    # n_process = 100
    # n_time = 200
    root_causes_list_2_config = (1000, 100, 200)
    root_causes_2_1 = [[21, 100, 200],[22, 100, 200],[23, 100, 200],[24, 100, 200],[25, 100, 200]] 
    root_causes_2_2 = [[51, 0, 50],[52, 0, 50],[53, 0, 50],[54, 0, 50],[55, 0, 50],
                       [51, 150, 200],[52, 150, 200],[53, 150, 200],[54, 150, 200],[55, 150, 200]]
    root_causes_2_3 = [[21, 50, 150],[22, 50, 150],[23, 50, 150],[24, 50, 150],[25, 50, 150],
                       [81, 100, 200],[82, 100, 200],[83, 100, 200],[84, 100, 200],[85, 100, 200]]
    root_causes_list_2 = [root_causes_2_1, root_causes_2_2, root_causes_2_3]
    
    #################### [1000, 300, 1000] scenario 1,2,3
    
    # n_observations = 1000
    # n_process = 150
    # n_time = 300
    root_causes_list_3_config = (1000, 150, 300)
    root_causes_3_1 = [[31, 100, 200],[32, 100, 200],[33, 100, 200],[34, 100, 200],[35, 100, 200],
                       [36, 100, 200],[37, 100, 200],[38, 100, 200],[39, 100, 200],[40, 100, 200]]
    root_causes_3_2 = [[71, 0, 100],[72, 0, 100],[73, 0, 100],[74, 0, 100],[75, 0, 100],
                       [76, 200, 300],[77, 200, 300],[78, 200, 300],[79, 200, 300],[70, 200, 300]]
    root_causes_3_3 = [[6, 50, 100],[7, 50, 100],[8, 50, 100],[9, 50, 100],[10, 50, 100],
                       [51, 200, 250],[52, 200, 250],[53, 200, 250],[54, 200, 250],[55, 200, 250],
                       [101, 50, 100],[102, 50, 100],[103, 50, 100],[104, 50, 100],[105, 50, 100],
                       [141, 200, 250],[142, 200, 250],[143, 200, 250],[144, 200, 250],[145, 200, 250]]
    root_causes_list_3 = [root_causes_3_1, root_causes_3_2, root_causes_3_3]
    
    root_cause_list = [root_causes_1_1, root_causes_1_2, root_causes_1_3,
                       root_causes_2_1, root_causes_2_2, root_causes_2_3,
                       root_causes_3_1, root_causes_3_2, root_causes_3_3]
    
    dataset_shape_list = [root_causes_list_1_config, root_causes_list_1_config, root_causes_list_1_config, 
                          root_causes_list_2_config, root_causes_list_2_config, root_causes_list_2_config, 
                          root_causes_list_3_config, root_causes_list_3_config, root_causes_list_3_config]

    return dataset_shape_list, root_cause_list


def RootCauses_200910():

    yymmdd = '200910'
    #################### [1000, 30, 100] scenario 1,2,3
    # n_observations = 1000
    # n_process = 50
    # n_time = 100
    root_causes_list_1_config = (1000, 50, 100)
    root_causes_1_1 = [[6, 40, 70],[7, 40, 70],[8, 40, 70]] 
    root_causes_1_2 = [[24, 10, 30],[25, 10, 30],[26, 10, 30],
                       [24, 70, 90],[25, 70, 90],[26, 70, 90]]
    root_causes_1_3 = [[1, 0, 50],[2, 0, 50],[3, 0, 50],[4, 0, 50],[5, 0, 50],
                       [45, 50, 100],[46, 50, 100],[47, 50, 100],[48, 50, 100],[49, 50, 100]] 
    root_causes_list_1 = [root_causes_1_1, root_causes_1_2, root_causes_1_3]
    
    #################### [1000, 100, 500] scenario 1,2,3
    # n_observations = 1000
    # n_process = 100
    # n_time = 200
    root_causes_list_2_config = (1000, 100, 200)
    root_causes_2_1 = [[21, 100, 200],[22, 100, 200],[23, 100, 200],[24, 100, 200],[25, 100, 200]] 
    root_causes_2_2 = [[51, 0, 50],[52, 0, 50],[53, 0, 50],[54, 0, 50],[55, 0, 50],
                       [51, 150, 200],[52, 150, 200],[53, 150, 200],[54, 150, 200],[55, 150, 200]]
    root_causes_2_3 = [[21, 50, 150],[22, 50, 150],[23, 50, 150],[24, 50, 150],[25, 50, 150],
                       [81, 100, 200],[82, 100, 200],[83, 100, 200],[84, 100, 200],[85, 100, 200]]
    root_causes_list_2 = [root_causes_2_1, root_causes_2_2, root_causes_2_3]
    
    #################### [1000, 300, 1000] scenario 1,2,3
    
    # n_observations = 1000
    # n_process = 150
    # n_time = 300
    root_causes_list_3_config = (1000, 150, 300)
    root_causes_3_1 = [[31, 100, 200],[32, 100, 200],[33, 100, 200],[34, 100, 200],[35, 100, 200],
                       [36, 100, 200],[37, 100, 200],[38, 100, 200],[39, 100, 200],[40, 100, 200]]
    root_causes_3_2 = [[71, 0, 100],[72, 0, 100],[73, 0, 100],[74, 0, 100],[75, 0, 100],
                       [76, 200, 300],[77, 200, 300],[78, 200, 300],[79, 200, 300],[70, 200, 300]]
    root_causes_3_3 = [[6, 50, 100],[7, 50, 100],[8, 50, 100],[9, 50, 100],[10, 50, 100],
                       [51, 200, 250],[52, 200, 250],[53, 200, 250],[54, 200, 250],[55, 200, 250],
                       [101, 50, 100],[102, 50, 100],[103, 50, 100],[104, 50, 100],[105, 50, 100],
                       [141, 200, 250],[142, 200, 250],[143, 200, 250],[144, 200, 250],[145, 200, 250]]
    root_causes_list_3 = [root_causes_3_1, root_causes_3_2, root_causes_3_3]
    
    root_cause_list = [root_causes_1_1, root_causes_1_2, root_causes_1_3,
                       root_causes_2_1, root_causes_2_2, root_causes_2_3,
                       root_causes_3_1, root_causes_3_2, root_causes_3_3]
    
    dataset_shape_list = [root_causes_list_1_config, root_causes_list_1_config, root_causes_list_1_config, 
                          root_causes_list_2_config, root_causes_list_2_config, root_causes_list_2_config, 
                          root_causes_list_3_config, root_causes_list_3_config, root_causes_list_3_config]
    return dataset_shape_list, root_cause_list

def RootCauses_200911():

    yymmdd = '200911'
    
    #################### [1000, 30, 100] scenario 1,2,3
    # n_observations = 1000
    # n_process = 50
    # n_time = 100
    root_causes_list_1_config = (1000, 50, 100)
    root_causes_1_1 = [[6, 40, 70],[7, 40, 70],[8, 40, 70]] 
    root_causes_1_2 = [[24, 10, 30],[25, 10, 30],[26, 10, 30],
                       [24, 70, 90],[25, 70, 90],[26, 70, 90]]
    root_causes_1_3 = [[0, 0, 50],[1, 0, 50],[2, 0, 50],[3, 0, 50],[4, 0, 50],[5, 0, 50],
                       [44, 50, 100],[45, 50, 100],[46, 50, 100],[47, 50, 100],[48, 50, 100],[49, 50, 100]] 
    root_causes_list_1 = [root_causes_1_1, root_causes_1_2, root_causes_1_3]
    
    #################### [1000, 100, 500] scenario 1,2,3
    # n_observations = 1000
    # n_process = 100
    # n_time = 200
    root_causes_list_2_config = (1000, 100, 200)
    root_causes_2_1 = [[20, 100, 200],[21, 100, 200],[22, 100, 200],[23, 100, 200],[24, 100, 200],[25, 100, 200]] 
    root_causes_2_2 = [[50, 0, 50],[51, 0, 50],[52, 0, 50],[53, 0, 50],[54, 0, 50],[55, 0, 50],
                       [50, 150, 200],[51, 150, 200],[51, 150, 200],[52, 150, 200],[53, 150, 200],[54, 150, 200],[55, 150, 200]]
    root_causes_2_3 = [[20, 50, 150],[21, 50, 150],[22, 50, 150],[23, 50, 150],[24, 50, 150],[25, 50, 150],
                       [80, 100, 200],[81, 100, 200],[82, 100, 200],[83, 100, 200],[84, 100, 200],[85, 100, 200]]
    root_causes_list_2 = [root_causes_2_1, root_causes_2_2, root_causes_2_3]
    
    #################### [1000, 300, 1000] scenario 1,2,3
    
    # n_observations = 1000
    # n_process = 150
    # n_time = 300
    root_causes_list_3_config = (1000, 150, 300)
    root_causes_3_1 = [[31, 100, 200],[32, 100, 200],[33, 100, 200],[34, 100, 200],[35, 100, 200],
                       [36, 100, 200],[37, 100, 200],[38, 100, 200],[39, 100, 200]]
    root_causes_3_2 = [[71, 0, 100],[72, 0, 100],[73, 0, 100],[74, 0, 100],[75, 0, 100],
                       [76, 200, 300],[77, 200, 300],[78, 200, 300],[79, 200, 300]]
    root_causes_3_3 = [[6, 50, 100],[7, 50, 100],[8, 50, 100],[9, 50, 100],[10, 50, 100],[11, 50, 100],
                       [51, 200, 250],[52, 200, 250],[53, 200, 250],[54, 200, 250],[55, 200, 250],[56, 200, 250],
                       [101, 50, 100],[102, 50, 100],[103, 50, 100],[104, 50, 100],[105, 50, 100],[106, 50, 100],
                       [141, 200, 250],[142, 200, 250],[143, 200, 250],[144, 200, 250],[145, 200, 250],[146, 200, 250]]
    root_causes_list_3 = [root_causes_3_1, root_causes_3_2, root_causes_3_3]
    
    root_cause_list = [root_causes_1_1, root_causes_1_2, root_causes_1_3,
                       root_causes_2_1, root_causes_2_2, root_causes_2_3,
                       root_causes_3_1, root_causes_3_2, root_causes_3_3]
    
    dataset_shape_list = [root_causes_list_1_config, root_causes_list_2_config, root_causes_list_3_config]
    return dataset_shape_list, root_cause_list


def RootCauses_200912():
    ################################################################################ 
    yymmdd = '200912' 
    ################################################################################ 
    
    #################### [1000, 30, 100] scenario 1,2,3
    # n_observations = 1000
    # n_process = 30
    # n_time = 100
    
    dataset_shape_1 = (1000, 30, 100)
    
    root_causes_1_1 = [[13, 40, 70],[14, 40, 70],[15, 40, 70]] 
    root_causes_1_2 = [[14, 10, 30],[14, 70, 90],[15, 10, 30],[15, 70, 90],[16, 10, 30],[16, 70, 90]] 
    root_causes_1_3 = [[0, 10, 40],[1, 10, 40],[2, 10, 40],[3, 10, 40],[4, 10, 40],[5, 10, 40],
                       [25, 60, 90],[26, 60, 90],[27, 60, 90],[28, 60, 90],[29, 60, 90]] 
    ''' 연속된 공정마다 같은 시간 원인 부여 '''
    
    #################### [1000, 100, 500] scenario 1,2,3
    # n_observations = 1000
    # n_process = 30
    # n_time = 100
    
    dataset_shape_2 = (1000, 30, 100)
    
    root_causes_2_1 = [[10, 10, 30],[10, 80, 100],
                       [11, 10, 30],[11, 80, 100],
                       [12, 10, 30],[12, 80, 100]] 
    
    root_causes_2_2 = [[4, 0, 50],[5, 10, 60],[6, 20, 70],
                       [14, 0, 50],[15, 10, 60],[16, 20, 70],
                       [24, 0, 50],[25, 40, 90],[26, 20, 70]]
    
    root_causes_2_3 = [[0, 30, 60],[1, 30, 60],[2, 30, 60],
                       [10, 40, 70],[11, 40, 70],[12, 40, 70],
                       [20, 50, 80],[21, 50, 80],[22, 50, 80]]
    ''' 연속된 공정은 같은시간, 떨어진 공정은 다른 시간 원인 부여 '''
    
    #################### [1000, 300, 1000] scenario 1,2,3
    # n_observations = 1000
    # n_process = 30
    # n_time = 100
    
    dataset_shape_3 = (1000, 30, 100)
    
    root_causes_3_1 = [[5, 0, 50],[6, 50, 100],[7, 10, 60],[8, 40, 90],[9, 20, 70],[10, 30, 80]] 
    root_causes_3_2 = [[11, 0, 50],[12, 50, 100],[13, 20, 70],
                       [24, 0, 50],[25, 50, 100],[26, 20, 70]]
    root_causes_3_3 = [[5, 0, 30],[6, 70, 100],[7, 30, 60],
                       [18, 0, 30],[19, 70, 100],[20, 30, 60],
                       [25, 0, 30],[26, 70, 100],[27, 30, 60]]
    
    ''' 연속된 공정, 떨어진 공정 모두 다른 시간 '''
    root_cause_list = [root_causes_1_1, root_causes_1_2, root_causes_1_3,
                       root_causes_2_1, root_causes_2_2, root_causes_2_3,
                       root_causes_3_1, root_causes_3_2, root_causes_3_3]
    
    dataset_shape_list = [dataset_shape_1, dataset_shape_2, dataset_shape_3]
    return yymmdd, dataset_shape_list, root_cause_list
